---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsBottomEndExceedsOrNotReachWarning
source: html/8152b7be-fef0-2fdb-9ac8-c86cf89fc0f9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsBottomEndExceedsOrNotReachWarning Property

Stair bottom end exceeds or cannot reach the base elevation of the stair. Add/remove risers at the bottom end or change base elevation settings in Stair Properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsBottomEndExceedsOrNotReachWarning { get; }
```